app/controllers/courses_controller.rb

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("name", "description", "duration", "date", "audit", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def add
    authenticate_user! unless user_signed_in?
    user = User.find(current_user.id)
    user.courses << @course if user.courses.where(id: @course.id).first.blank?
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" INNER JOIN "courses_users" ON "courses"."id" = "courses_users"."course_id" WHERE "courses_users"."user_id" = $1 AND "courses"."id" = $2 ORDER BY "courses"."id" ASC LIMIT $3  [["user_id", 3], ["id", 1], ["LIMIT", 1]]

  def remove
    authenticate_user! unless user_signed_in?
    user = User.find(current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]