app/controllers/home_controller.rb

  def profile
    user = User.find(current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]